# Brewfile — managed by chezmoi
# Install: brew bundle --file=~/.Brewfile
# Check:   brew bundle check --file=~/.Brewfile

cask_args appdir: "~/Applications"

# ── Shell & Terminal ──────────────────────────────────────────────────
brew "fish"

# ── Core CLI ─────────────────────────────────────────────────────────
brew "git"
brew "gh"
brew "awscli"
brew "chezmoi"

brew "mise"    # polyglot version manager (replaces nvm, rbenv, pyenv)
brew "colima"  # container runtime (replaces OrbStack)
brew "docker"          # docker CLI for colima
brew "docker-compose"  # Compose v2 plugin for colima
brew "libyaml"         # required for ruby via mise

# ── Casks ─────────────────────────────────────────────────────────────
cask "gitx"
cask "cursor"
cask "ghostty"
cask "slack"
cask "tableplus"
cask "telegram"
cask "zed"
cask "setapp"
cask "comet"
